src/cf/Catalogs/ПоказателиРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПоказателиРасчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольныйЗапрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадаватьЗначениеПриРасчетеЗП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоказателяРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПоказателейРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляРасчетаВРасширении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПериодыОтбораДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДатаГраницы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДатыГраницы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГраницыПериода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыГраницПериода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодСмещения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодСдвиг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезСкидкиИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьБезНДСИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураНабора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНабора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДвижениеЧекаВОткрытойСмене</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ТипыПоказателейРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПоказателейРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ручной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расширение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПоказателиРасчетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	// Сумма продаж по ответственному (СПО)
	Если НЕ ЗарплатаУНФВызовСервера.ПараметрРасчетаСуществует("СуммуПродажПоОтветственному") Тогда
		Элемент = Элементы.Добавить();
		Элемент.Идентификатор = "СуммуПродажПоОтветственному";
		Элемент.Наименование = НСтр("ru='Сумму продаж по ответственному'");
		Элемент.ПроизвольныйЗапрос = Истина;
		Элемент.ТипПоказателяРасчетов = Перечисления.ТипыПоказателейРасчета.Запрос;
		Элемент.Используется = Истина;
		
		ПараметрыЗапроса = ТабличныеЧасти.ПараметрыЗапроса.СКопировать();
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "ВалютаУчетаКурс";
		ЭлементТЧ.Представление = НСтр("ru='ВалютаУчетаКурс'");
		
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "ВалютаДокументаКратность";
		ЭлементТЧ.Представление = НСтр("ru='ВалютаДокументаКратность'");
		
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "ВалютаДокументаКурс";
		ЭлементТЧ.Представление = НСтр("ru='ВалютаДокументаКурс'");
		
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "ВалютаУчетаКратность";
		ЭлементТЧ.Представление = НСтр("ru='ВалютаУчетаКратность'");
		
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "НачалоПериода";
		ЭлементТЧ.Представление = НСтр("ru='НачалоПериода'");
		
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "КонецПериода";
		ЭлементТЧ.Представление = НСтр("ru='КонецПериода'");
		
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "Организация";
		ЭлементТЧ.Представление = НСтр("ru='Организация'");
		
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "Подразделение";
		ЭлементТЧ.Представление = НСтр("ru='Подразделение'");
		
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "Сотрудник";
		ЭлементТЧ.Представление = НСтр("ru='Сотрудник'");
		
		Элемент.ПараметрыЗапроса = ПараметрыЗапроса;
		Элемент.Запрос = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЕСТЬNULL(Продажи.Сумма * &ВалютаУчетаКурс * &ВалютаДокументаКратность / (&ВалютаДокументаКурс * &ВалютаУчетаКратность), 0)) КАК СуммаПродаж
		|ИЗ
		|	РегистрНакопления.Продажи КАК Продажи
		|ГДЕ
		|	Продажи.Сумма >= 0
		|	И Продажи.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Продажи.Организация = &Организация
		|	И Продажи.Подразделение = &Подразделение
		|	И Продажи.Ответственный = &Сотрудник
		|	И (ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.АктВыполненныхРабот) ССЫЛКА Документ.АктВыполненныхРабот
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ЗаказПокупателя) ССЫЛКА Документ.ЗаказПокупателя
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ОтчетОПереработке) ССЫЛКА Документ.ОтчетОПереработке
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ОтчетОРозничныхПродажах) ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.РасходнаяНакладная) ССЫЛКА Документ.РасходнаяНакладная
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ЧекККМ) ССЫЛКА Документ.ЧекККМ)
		|
		|СГРУППИРОВАТЬ ПО
		|	Продажи.Ответственный";
	КонецЕсли;
	
	
	// Фиксированная сумма
	Если НЕ ЗарплатаУНФВызовСервера.ПараметрРасчетаСуществует("ФиксированнаяСумма") Тогда
		Элемент = Элементы.Добавить();
		Элемент.Идентификатор = "ФиксированнаяСумма";
		Элемент.Наименование = НСтр("ru='Фиксированная сумма'");
		Элемент.ПроизвольныйЗапрос = Ложь;
		Элемент.ТипПоказателяРасчетов = Перечисления.ТипыПоказателейРасчета.Ручной;
		Элемент.Используется = Истина;
	КонецЕсли;
	
	
	// Норма дней
	Если НЕ ЗарплатаУНФВызовСервера.ПараметрРасчетаСуществует("НормаДней") Тогда
		Элемент = Элементы.Добавить();
		Элемент.Идентификатор = "НормаДней";
		Элемент.Наименование = НСтр("ru='Норма дней (производственный календарь)'");
		Элемент.ПроизвольныйЗапрос = Истина;
		Элемент.ТипПоказателяРасчетов = Перечисления.ТипыПоказателейРасчета.Запрос;
		Элемент.Используется = Истина;
		
		ПараметрыЗапроса = ТабличныеЧасти.ПараметрыЗапроса.СКопировать();
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "Организация";
		ЭлементТЧ.Представление = НСтр("ru='Организация'");
		
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "ПериодРегистрации";
		ЭлементТЧ.Представление = НСтр("ru='Период регистрации'");
		
		Элемент.ПараметрыЗапроса = ПараметрыЗапроса;
		Элемент.Запрос =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК НормаДней
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО КалендарныеГрафики.Календарь = Организации.ПроизводственныйКалендарь
		|			И (Организации.Ссылка = &Организация)
		|ГДЕ
		|	КалендарныеГрафики.Год = ГОД(&ПериодРегистрации)
		|	И КалендарныеГрафики.ДатаГрафика МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И КалендарныеГрафики.ДеньВключенВГрафик";
	КонецЕсли;
	
	
	// Норма часов
	Если НЕ ЗарплатаУНФВызовСервера.ПараметрРасчетаСуществует("НормаЧасов") Тогда
		Элемент = Элементы.Добавить();
		Элемент.Идентификатор = "НормаЧасов";
		Элемент.Наименование = НСтр("ru='Норма часов (производственный календарь)'");
		Элемент.ПроизвольныйЗапрос = Истина;
		Элемент.ТипПоказателяРасчетов = Перечисления.ТипыПоказателейРасчета.Запрос;
		Элемент.Используется = Истина;
		
		ПараметрыЗапроса = ТабличныеЧасти.ПараметрыЗапроса.Скопировать();
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "Организация";
		ЭлементТЧ.Представление = НСтр("ru='Организация'");
		
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "ПериодРегистрации";
		ЭлементТЧ.Представление = НСтр("ru='Период регистрации'");
		
		Элемент.ПараметрыЗапроса = ПараметрыЗапроса;
		Элемент.Запрос =
		"ВЫБРАТЬ
		|	СУММА(8) КАК НормаЧасов
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО КалендарныеГрафики.Календарь = Организации.ПроизводственныйКалендарь
		|			И (Организации.Ссылка = &Организация)
		|ГДЕ
		|	КалендарныеГрафики.Год = ГОД(&ПериодРегистрации)
		|	И КалендарныеГрафики.ДатаГрафика МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И КалендарныеГрафики.ДеньВключенВГрафик";
	КонецЕсли;
	
	
	// Норма дней по графику
	Если НЕ ЗарплатаУНФВызовСервера.ПараметрРасчетаСуществует("НормаДнейГрафикСотрудника") Тогда
		Элемент = Элементы.Добавить();
		Элемент.Идентификатор = "НормаДнейГрафикСотрудника";
		Элемент.Наименование = НСтр("ru='Норма дней (график работы сотрудника)'");
		Элемент.ПроизвольныйЗапрос = Истина;
		Элемент.ТипПоказателяРасчетов = Перечисления.ТипыПоказателейРасчета.Запрос;
		Элемент.Используется = Истина;
		
		ПараметрыЗапроса = ТабличныеЧасти.ПараметрыЗапроса.Скопировать();
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "ПериодРегистрации";
		ЭлементТЧ.Представление = НСтр("ru='Период регистрации'");
		
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "ГрафикРаботы";
		ЭлементТЧ.Представление = НСтр("ru='График работы'");
		
		Элемент.ПараметрыЗапроса = ПараметрыЗапроса;
		Элемент.Запрос =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДЕНЬ(ГрафикиРаботы.ВремяНачала)) КАК НормаДней
		|ИЗ
		|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
		|ГДЕ
		|	ГрафикиРаботы.ГрафикРаботы = &ГрафикРаботы
		|	И ГрафикиРаботы.ВремяНачала МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И ГрафикиРаботы.Год = ГОД(&ПериодРегистрации)";
	КонецЕсли;
	
	
	// Норма часов по графику
	Если НЕ ЗарплатаУНФВызовСервера.ПараметрРасчетаСуществует("НормаЧасовГрафикСотрудника") Тогда
		Элемент = Элементы.Добавить();
		Элемент.Идентификатор = "НормаЧасовГрафикСотрудника";
		Элемент.Наименование = НСтр("ru='Норма часов (график работы сотрудника)'");
		Элемент.ПроизвольныйЗапрос = Истина;
		Элемент.ТипПоказателяРасчетов = Перечисления.ТипыПоказателейРасчета.Запрос;
		Элемент.Используется = Истина;
		
		ПараметрыЗапроса = ТабличныеЧасти.ПараметрыЗапроса.Скопировать();
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "ПериодРегистрации";
		ЭлементТЧ.Представление = НСтр("ru='Период регистрации'");
		
		ЭлементТЧ = ПараметрыЗапроса.Добавить();
		ЭлементТЧ.Имя = "ГрафикРаботы";
		ЭлементТЧ.Представление = НСтр("ru='График работы'");
		
		Элемент.ПараметрыЗапроса = ПараметрыЗапроса;
		Элемент.Запрос =
		"ВЫБРАТЬ
		|	СУММА(ГрафикиРаботы.ЧасыРаботы) КАК НормаЧасов
		|ИЗ
		|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
		|ГДЕ
		|	ГрафикиРаботы.ГрафикРаботы = &ГрафикРаботы
		|	И ГрафикиРаботы.ВремяНачала МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И ГрафикиРаботы.Год = ГОД(&ПериодРегистрации)";
	КонецЕсли;
	
	
	// Отработано дней
	Если НЕ ЗарплатаУНФВызовСервера.ПараметрРасчетаСуществует("ОтработаноДней") Тогда
		Элемент = Элементы.Добавить();
		Элемент.Идентификатор = "ОтработаноДней";
		Элемент.Наименование = НСтр("ru='Отработано дней'");
		Элемент.ПроизвольныйЗапрос = Ложь;
		Элемент.ТипПоказателяРасчетов = Перечисления.ТипыПоказателейРасчета.Ручной;
		Элемент.Используется = Истина;
	КонецЕсли;
	
	
	// Отработано часов
	Если НЕ ЗарплатаУНФВызовСервера.ПараметрРасчетаСуществует("ОтработаноЧасов") Тогда
		Элемент = Элементы.Добавить();
		Элемент.Идентификатор = "ОтработаноЧасов";
		Элемент.Наименование = НСтр("ru='Отработано часов'");
		Элемент.ПроизвольныйЗапрос = Ложь;
		Элемент.ТипПоказателяРасчетов = Перечисления.ТипыПоказателейРасчета.Ручной;
		Элемент.Используется = Истина;
	КонецЕсли;
	
	
	// Тарифная ставка
	Если НЕ ЗарплатаУНФВызовСервера.ПараметрРасчетаСуществует("ТарифнаяСтавка") Тогда
		Элемент = Элементы.Добавить();
		Элемент.Идентификатор = "ТарифнаяСтавка";
		Элемент.Наименование = НСтр("ru='Тарифная ставка'");
		Элемент.ПроизвольныйЗапрос = Ложь;
		Элемент.ТипПоказателяРасчетов = Перечисления.ТипыПоказателейРасчета.Ручной;
		Элемент.Используется = Истина;
	КонецЕсли;
	
	
	// Отработано по заданиям
	Если НЕ ЗарплатаУНФВызовСервера.ПараметрРасчетаСуществует("ОтработаноЧасовПоЗаданиям") Тогда
		
		Элемент = Элементы.Добавить();
		ОписаниеПараметра = ОписаниеОтработаноЧасовПоЗаданиям();
		ЗаполнитьЗначенияСвойств(Элемент, ОписаниеПараметра);
		
		Элемент.Используется = ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаРаботу");
		Для Каждого ЭлементТабличныеЧасти Из ОписаниеПараметра.ТабличныеЧасти Цикл
			ПараметрыЗапроса = ТабличныеЧасти[ЭлементТабличныеЧасти.Ключ].Скопировать();
			Для Каждого Строка Из ЭлементТабличныеЧасти.Значение Цикл
				ЭлементТЧ = ПараметрыЗапроса.Добавить();
				ЗаполнитьЗначенияСвойств(ЭлементТЧ, Строка);
			КонецЦикла;
			Элемент[ЭлементТабличныеЧасти.Ключ] = ПараметрыЗапроса;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Объект.УстановитьНовыйКод();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Функция - Шаблон процедуры подключаемого показателя расчета
//
// Параметры:
//  ИдентификаторПоказателяРасчета	 - Строка - идентификатор показателя
// 
// Возвращаемое значение:
//  Строка - шаблон процедуры
//
Функция ШаблонПроцедурыПодключаемогоПоказателяРасчета(ИдентификаторПоказателяРасчета) Экспорт
	
	// АПК:1299-выкл проектное решение
	ШаблонПроцедуры = 
		НСтр("ru = '
		|// Процедура заполняет выполняет расчет показателя в документе расчета зарплаты
		|//
		|// Параметры:
		|//  ПараметрыПроцедуры - Структура:
		|//     * РезультатРасчета - Число - в эту переменную следует поместить результат расчета
		|//     * СтруктураПараметров  - Структура параметров строки расчета
		|//     * ПоказательРасчета - СправочникСсылка.ПоказателиРасчетов - рассчитываемый показатель
		|//     * ТекстОшибки - Строка - текст ошибки
		|//
		|Процедура РассчитатьПоказательРасчета_%1(ПараметрыПроцедуры) Экспорт
		|	
		|	// Вставить содержимое процедуры.
		|	
		|КонецПроцедуры'");
	// АПК:1299-вкл
	
	АдаптированныйИдентификатор = СтрЗаменить(ИдентификаторПоказателяРасчета, "-", "_");
	ШаблонПроцедуры = СтрШаблон(ШаблонПроцедуры, АдаптированныйИдентификатор);
	
	Возврат ШаблонПроцедуры;
	
КонецФункции

// Процедура - Установить признак использования при обновлении
//
Процедура УстановитьПризнакИспользованияПриОбновлении() Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПараметрыРасчетов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПоказателиРасчетов КАК ПараметрыРасчетов";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ОбъектПараметр = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектПараметр.Заблокировать();
			ОбъектПараметр.Используется = Истина;
			ОбъектПараметр.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		СообщениеОбОшибке = НСтр("ru='Установить признак используется для параметров расчетов'", 
		ОбщегоНазначения.КодОсновногоЯзыка());
		
		ЗаписьЖурналаРегистрации(СообщениеОбОшибке, УровеньЖурналаРегистрации.Ошибка, , , 
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

// Включение / отключение использования параметров расчетов, которые используются оплате заданий на работу
//
// Параметры:
//  Использование	 - Булево	- новое значение реквизита Используется
//
Процедура УстановитьИспользованиеОтработаноЧасовПоЗаданиям(Использование) Экспорт
	
	ОписаниеПоказателя = ОписаниеОтработаноЧасовПоЗаданиям();
	
	ПоказательСсылка = НайтиПоРеквизиту("Идентификатор", ОписаниеПоказателя.Идентификатор);
	Если ЗначениеЗаполнено(ПоказательСсылка) Тогда
		ПоказательОбъект = ПоказательСсылка.ПолучитьОбъект();
	ИначеЕсли Использование Тогда
		ПоказательОбъект = СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ПоказательОбъект, ОписаниеПоказателя);
		Для Каждого ЭлементТабличнаяЧасти Из ОписаниеПоказателя.ТабличныеЧасти Цикл
			ТабличнаяЧасть = ПоказательОбъект[ЭлементТабличнаяЧасти.Ключ];
			Для Каждого СтрокаОписания Из ЭлементТабличнаяЧасти.Значение Цикл
				НоваяСтрока = ТабличнаяЧасть.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОписания);
			КонецЦикла;
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
	ПоказательОбъект.Используется = Использование;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПоказательОбъект);		
	
КонецПроцедуры

Процедура ДополнитьПараметрыРасчета() Экспорт
		
	// Норма дней по графику
	Если НЕ ЗарплатаУНФВызовСервера.ПараметрРасчетаСуществует("НормаДнейГрафикСотрудника") Тогда
		
		ПараметрРасчетовНормаДней = СоздатьЭлемент();
		ПараметрРасчетовНормаДней.Наименование 		 = НСтр("ru='Норма дней (график работы сотрудника)'");
		ПараметрРасчетовНормаДней.Идентификатор 	 = "НормаДнейГрафикСотрудника";
		ПараметрРасчетовНормаДней.ПроизвольныйЗапрос = Истина;
		ПараметрРасчетовНормаДней.ТипПоказателяРасчетов = Перечисления.ТипыПоказателейРасчета.Запрос;
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаДней.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ПериодРегистрации";
		НовыйПараметрЗапроса.Представление 			 = "Период регистрации";
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаДней.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ГрафикРаботы";
		НовыйПараметрЗапроса.Представление 			 = "График работы";
		
		ПараметрРасчетовНормаДней.Запрос 			 = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДЕНЬ(ГрафикиРаботы.ВремяНачала)) КАК НормаДней
		|ИЗ
		|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
		|ГДЕ
		|	ГрафикиРаботы.ГрафикРаботы = &ГрафикРаботы
		|	И ГрафикиРаботы.ВремяНачала МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И ГрафикиРаботы.Год = ГОД(&ПериодРегистрации)";
		
		ПараметрРасчетовНормаДней.Записать();
		
	КонецЕсли;
	
	// Норма часов по графику
	Если НЕ ЗарплатаУНФВызовСервера.ПараметрРасчетаСуществует("НормаЧасовГрафикСотрудника") Тогда
		
		ПараметрРасчетовНормаЧасов = СоздатьЭлемент();
		ПараметрРасчетовНормаЧасов.Наименование 	  = НСтр("ru='Норма часов (график работы сотрудника)'");
		ПараметрРасчетовНормаЧасов.Идентификатор 	  = "НормаЧасовГрафикСотрудника";
		ПараметрРасчетовНормаЧасов.ПроизвольныйЗапрос = Истина;
		ПараметрРасчетовНормаЧасов.ТипПоказателяРасчетов = Перечисления.ТипыПоказателейРасчета.Запрос;
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаЧасов.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ПериодРегистрации";
		НовыйПараметрЗапроса.Представление 			 = "Период регистрации";
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаЧасов.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ГрафикРаботы";
		НовыйПараметрЗапроса.Представление 			 = "График работы";
		
		ПараметрРасчетовНормаЧасов.Запрос 			 = 
		"ВЫБРАТЬ
		|	СУММА(ГрафикиРаботы.ЧасыРаботы) КАК НормаЧасов
		|ИЗ
		|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
		|ГДЕ
		|	ГрафикиРаботы.ГрафикРаботы = &ГрафикРаботы
		|	И ГрафикиРаботы.ВремяНачала МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И ГрафикиРаботы.Год = ГОД(&ПериодРегистрации)";
		ПараметрРасчетовНормаЧасов.Записать();
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("СобственныйВызов") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Параметры.Вставить("СобственныйВызов");
		Отбор = Новый Структура;
		Отбор.Вставить("Используется", Истина);
		Параметры.Вставить("Отбор", Отбор);
		СтандартныйСписок = ПолучитьДанныеВыбора(Параметры);
		ДанныеВыбора = СтандартныйСписок;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеОтработаноЧасовПоЗаданиям()
	
	ДанныеПоказателя = Новый Структура;
	ДанныеПоказателя.Вставить("Идентификатор", "ОтработаноЧасовПоЗаданиям");
	ДанныеПоказателя.Вставить("Наименование", НСтр("ru='Отработано часов по заданиям'"));
	ДанныеПоказателя.Вставить("ПроизвольныйЗапрос", Истина);
	ДанныеПоказателя.Вставить("ТипПоказателяРасчетов", Перечисления.ТипыПоказателейРасчета.Запрос);
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Источник.ЗагрузкаФактОборот КАК ЗагрузкаФактОборот
		|ИЗ
		|	РегистрНакопления.ЗаданияНаРаботу.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК Источник
		|ГДЕ
		|	Источник.Сотрудник = &Сотрудник
		|	И Источник.СтруктурнаяЕдиница = &Подразделение
		|	И Источник.Организация = &Организация";
	
	ДанныеПоказателя.Вставить("Запрос", ТекстЗапроса);
	ДанныеПоказателя.Вставить("ТабличныеЧасти", Новый Структура);
	
	КолонкиПараметры = Новый ФиксированнаяСтруктура("Имя, Представление");
	ТЧПараметрыЗапроса = Новый Массив;
	ДанныеПоказателя.ТабличныеЧасти.Вставить("ПараметрыЗапроса", ТЧПараметрыЗапроса);
	
	СтрокаПараметр = Новый Структура(КолонкиПараметры);
	СтрокаПараметр.Имя = "НачалоПериода";
	СтрокаПараметр.Представление = НСтр("ru='Начало периода'");
	ТЧПараметрыЗапроса.Добавить(СтрокаПараметр);
	
	СтрокаПараметр = Новый Структура(КолонкиПараметры);
	СтрокаПараметр.Имя = "КонецПериода";
	СтрокаПараметр.Представление = НСтр("ru='Конец периода'");
	ТЧПараметрыЗапроса.Добавить(СтрокаПараметр);
	
	СтрокаПараметр = Новый Структура(КолонкиПараметры);
	СтрокаПараметр.Имя = "Сотрудник";
	СтрокаПараметр.Представление = НСтр("ru='Сотрудник'");
	ТЧПараметрыЗапроса.Добавить(СтрокаПараметр);
		
	СтрокаПараметр = Новый Структура(КолонкиПараметры);
	СтрокаПараметр.Имя = "Организация";
	СтрокаПараметр.Представление = НСтр("ru='Организация'");
	ТЧПараметрыЗапроса.Добавить(СтрокаПараметр);
		
	СтрокаПараметр = Новый Структура(КолонкиПараметры);
	СтрокаПараметр.Имя = "Подразделение";
	СтрокаПараметр.Представление = НСтр("ru='Подразделение'");
	ТЧПараметрыЗапроса.Добавить(СтрокаПараметр);
	
	Возврат ДанныеПоказателя;
КонецФункции

#КонецОбласти

#КонецЕсли
